#!/bin/bash

echo "Привет, это мой первый скрипт на bash, здесь мы выполняем пункты 3,4,5,6,7,8,13 из задания"
mkdir main_folder # Создаем папку чтобы выполнить пункт №3
cd main_folder    # 3) Зайти в папку
mkdir p1 p2 p3    # 4) Создать 3 папки
cd p2             # 5) Зайти в любоую папку
touch touch 1.txt 2.txt 3.txt 1.json 2.json # 6) Создать 5 файлов (3 txt, 2 json)
mkdir pp1 pp2 pp3 # 7) Создать 3 папки
ls -la            # 8) Вывести список содержимого папки
cd ..             # дополнительная команда, чтобы выполнить пункт №13
mv p2/{1.txt,1.json} p3 # 13) переместить любые 2 файла, которые вы создали, в любую другую папку.

